---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments
source: html/36bb5416-2d70-733c-8248-b509169de596.htm
---
# RebarShapeDefinitionBySegments Members

Create a rebar shape definition with a given number of segments.